# <center><font face="arial" size="5" color=#0101DF>NUMERIQUE ET SCIENCES INFORMATIQUES Terminale NSI</font></center>

## <font color=#013ADF>Séquence N° 5 : Bases de données - Structured Query Language (SQL) 1ère partie</font>

<div class="alert alert-danger" role="alert">
    
Les objectifs de cette séquence sont :

- Identifier les concepts définissant le modèle relationnel ;
- Savoir distinguer la structure d'une base de données de son contenu ;
- Repérer des anomalies dans le schéma d'une base de données ;
- Identifier les services rendus par un système de gestion de bases de données relationnelles : persistance des données, gestion des accès concurrrents, efficacité de traitemenet des requêtes, sécurisation des accès ;
- Identifier les composants d'une requête ;
- Construire des requêtes d'interrogation à l'aide des clauses du langage SQL : SELECT, FROM, WHERE, JOIN ;
- Construire des requêtes d'insertion et de mise à jour à l'aide de : UPDATE, INSERT, DELETE.


</div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>
    
Travail préalable   

- Reprendre la séquence 8 "Données en table" de la classe de première (notebook "Elections.ipynb"):
    - vocabulaire : attribut, enregistrement, vecteur, projection, jointure, selection ;
    - Lecture/écriture de fichiers CSV.
- Lire les chapitres 5  et 6 du livre.
    
*Remarques :*
- On ne vous demande pas de savoir réaliser un modèle Entité/Association (ou Relation), mais de savoir le lire.
- À ne pas perdre de vue : https://www.cnil.fr/fr/comprendre-le-rgpd
    
**Problématique :**

Comment stocker les données sur les élèves de terminale de l'école ainsi que leur ville de résidence sous forme d'un code postal et du libellé de la ville ?



| Id_eleve | nom     | prenom   |  statut   | code postal | libellé ville |
| :------: | ------- | -------- | :-------: | :---------: | :-----------: |
|    1     | Bourgon | Élise    | demi-pens |    29490    |   Guipavas    |
|    2     | Jacq    | Christine | demi-pens |    29820    |    Guilers    |
|    3     | Durand  | Mathis   |  externe  |    29200    |     Brest     |
|    4     | Gontran | Élouan   | demi-pens |    29290    |  Saint Renan  |
|    5     | Fox     | Titouan  | demi-pens |    29490    |   Guipavas    |
|    6     | Majo    | Aya      |  externe  |    29200    |     Brest     |
|    7     | Tripaux | Jean     |  interne  |    29160    |    Crozon     |
|    8     | Chavin  | Hassan   |  interne  |    29590    |    Le Faou    |
|    9     | Marvaux | Éloi     |  externe  |    29200    |     Brest     |
|    10    | Savino  | Manel    |  interne  |    29830    | Ploudalmézeau, Terre de gens géniaux  |
    
- On propose cette table. Que peut-on lui reprocher ?
- Revisons le vocabulaire : attribut, champ, domaine, donnée enregistrement, vecteur, n-uplet, relation, projection, sélection, jointure
<div>

Voc
- Attribut : c'est l'intitulé d'une colonne (nom, statut, ...)
- Domaine : (champ) -> Domaine de valeurs. C'est l'équivalent du typage en Python (TEXT, INTEGER, REAL, ...). Et pour quelques valeurs, le domaine est défini
- Donnée, Enregistrement, Vecteur, N-Uplet : C'est une ligne d'une table de la BDD
- Relation : Une table
- Projection : C'est retenir un certain nombre d'attributs
- Séléction : C'est choisir un certain nombre d'enregistrements
- Jointure : C'est faire un lien entre plusieurs tables (2 mini) pour réunir ces tables et obtenir des attibuts appartenant à plusieurs tables

### 1- Le modèle Entité/Association (ou relation)

<div class="alert alert-success">


<img src="Images/Villes.svg" alt="ville_db" width=30% align=center>   
    

**Comment lire ce modèle ?**
    
Une entité de la table **ELEVES** habite dans 1 et 1 seule VILLE ;

Une entité de la table **VILLE** est habité par 0 ou plusieurs (N) élèves.
    
**Compte-tenu des cardinalités**, il en résulte la **création de 2 tables** ayant les attributs suivants :
    
    
| Id_eleve | nom     | prenom   |  statut   | code postal |
| :------: | ------- | -------- | :-------: | :---------: |
|    1     | Bourgon | Élise    | demi-pens |    29490    |
|    2     | Jacq    | Christine | demi-pens |    29820    |
|    3     | Durand  | Mathis   |  externe  |    29200    |
|    4     | Gontran | Élouan   | demi-pens |    29290    |
|    5     | Fox     | Titouan  | demi-pens |    29490    |
|    6     | Majo    | Aya      |  externe  |    29200    |
|    7     | Tripaux | Jean     |  interne  |    29160    |
|    8     | Chavin  | Hassan   |  interne  |    29590    |
|    9     | Marvaux | Éloi     |  externe  |    29200    |
|    10    | Savino  | Manel    |  interne  |    29830    |
    
Où **Id_Eleve** est la **clé primaire** de la table **ELEVES** et **Code_postal** est la **clé étrangère**.
    
| code postal | libellé ville |
| :---------: | :-----------: |
|    29490    |   Guipavas    |
|    29820    |    Guilers    |
|    29200    |     Brest     |
|    29290    |  Saint Renan  |
|    29160    |    Crozon     |
|    29590    |    Le Faou    |
|    29830    | Ploudalmézeau |
    
Où **Code postal** est la **clé primaire** de la table **VILLE**.

<img src="Images/warning.png" alt="warning" width=5% align=left>
    
    
Clé primaire : permet d'accéder aux données d'un enregistrement de façon claire et unique.
    
Clé étrangère : Lien avec l'identifiant d'une autre table.
<div>

### 2- Le modèle relationnel

<div class="alert alert-success">

<img src="Images/modele_relationnel.png" alt="relationnel" width=50% align=center>
    
**ELEVE ( Id_eleve, nom, prenom, status, code postal )**
    
Le champ Id_eleve constitue la clef primaire de la table. C'était déjà un identifiant de l'entité ELEVE.
    
Les champs nom, prenom et status étaient déjà de simples attributs de l'entité ELEVE.
    
Le champ code postal est une clef étrangère. Il a migré à partir de l'entité VILLE par l'association de dépendance fonctionnelle HABITE en perdant son caractère identifiant.
    
**VILLE ( code postal, libelle_ville )**
    
Le champ code postal constitue la clef primaire de la table. C'était déjà un identifiant de l'entité VILLE.
    
Le champ libelle_ville était déjà un simple attribut de l'entité VILLE.
<div>

### 3- Le modèle physique : système de gestion de base de donnée relationnel (SGBD) relationnel

#### 3-1 Architecture 3 tiers

<img src="Images/architecture_3tiers.jpg" alt="serveurs" width=60% align=center>

L'architecture classique est une architecture à 3 niveaux, c'est-à-dire que l'on a une architecture partagée entre :

Le client qui demande des ressources (à partir de son navigateur)

Le serveur d'application (serveur http) : le serveur chargé de fournir la ressource mais faisant appel à un autre serveur (Apache Nginx ...)

Le serveur secondaire (serveur de base de données): fournit un service au premier serveur (Mysql, PostgreSQ ...)

#### 3-2 SQLite

**SQLite** est une bibliothèque qui propose un moteur de base de données relationnelle accessible par le langage SQL.

https://sql.sh/sgbd/sqlite

Contrairement aux serveurs de bases de données traditionnels, sa particularité est de ne pas reproduire le schéma habituel client-serveur mais d'être directement intégrée aux programmes. L'intégralité de la base de données (déclarations, tables, index et données) est stockée dans un fichier indépendant de la plateforme.

En parcourant les répertoires de Firefox : /home/user/.mozilla/firefox/l11uob7t.default/, on peut y trouver plusieurs bases SQLite dont celle des cookies : cookies.sqlite


**C'est cette option que nous allons choisir car moins lourde à mettre en oeuvre.**

Pour visualiser le contenu d'une base, on peut utiliser :

- DB browser for sqlite (à installer sur un poste) ;
- Un outil en ligne : https://extendsclass.com/sqlite-browser.html
- En ligne de commande ...

#### 3-3 Propriétés d'un SGBD (ACID)

<div class="alert alert-success">
    
Un SGBD doit assurer un ensemble de fonctions :

Le SGBD doit assurer la persistance des données. Il doit assurer la pérennité de la structure quelque soit les modifications. de plus l'accès aux données doit être garanti en toute circonstance : panne matérielle, logicielle, coupure de courant, etc.

Le SGBD doit gérer les accès concurrents. Tout comme le système d'exploitation linux étudié en première, il gère un système de droits et de privilèges pour des utilisateurs et des groupes d'utilisateurs.
    
Le SGBD doit être efficace. Cette efficacité tient à des algorithmes puissants qui ne sont pas 'visibles' par les utilisateurs.

Au sein d’une base de données, le terme de **transaction** désigne les opérations apportant des modifications aux données. Par exemple, un virement bancaire provoquant le débit du compte de l’émetteur et le crédit du compte du bénéficiaire est une transaction.

Ces transactions doivent toutefois présenter quatre propriétés visant à garantir leur validité même en cas d’erreur ou de pannes informatiques. Ces quatre propriétés sont l’**atomicité**, la **cohérence**, l’**isolation** et la **durabilité**. Afin de mémoriser facilement ces attributs, Andreas Reuter et Theo Härder ont inventé l’acronyme  » ACID  » en 1983.

L’**atomicité** des transactions au sein des bases de données signifie que tous les changements apportés aux données sont effectués totalement, ou pas du tout. Elle permet d’éviter que les changements prennent effet en cas de panne de l’application ou du serveur de la base de données en plein milieu de la transaction. Ainsi, la base de données ne risque pas d’être corrompue par des opérations imprévisibles et à moitié complétées.

La **cohérence** signifie que les transactions doivent respecter les contraintes d’intégrité des données de la base de données. Ainsi, une transaction qui commence avec un ensemble de données cohérent doit résulter par un ensemble de données cohérent. Pour maintenir la cohérence, un système de base de données peut abandonner les transactions qui risquent de provoquer une incohérence.

L’**isolation** signifie que les écritures et lectures des transactions réussies ne seront pas affectées par les écritures et lectures d’autres transactions, qu’elles soient ou non réussies.

La **durabilité** garantit que les transactions réussies survivront de façon permanente et ne seront pas affectées par d’éventuelles pannes ou problèmes techniques. Les changements apportés aux données doivent être permanents.

source : https://www.lebigdata.fr/acid-base-de-donnees-definition
    
<div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>
    
**Exercice**

Pour chacun des sénarios suivant dire laquelle des 4 propriétés ACID est mise en jeu :

1- On exécute intégralement une transaction. La machine exécutant le SGBD subit une panne de courant. Au redémarrage, l'effet de la transaction a bien été pris en compte.
    
2- Une table T2 contient des clés étrangères, référençant les clés d'une table T1. On exécute une transaction qui modifie T2. Après la transaction T2 contient toujours des clés étrangères.
    
3- Une transaction tente d'insérer 10 enregistrements dans une relation. L'insertion du 9ème enregistrement échoue, à cause d'une contrainte de clé primaire. La transaction est annulée et aucune des lignes ne se retrouve dans la relation.
    
4- Sur une relation R contenant un attribut "n" de type entier, on exécute deux transactions, "en même temps". La première ajoute 1 à toutes les données de l'attribut "n" et la seconde retire 1 à ce même attribut. Le contenu de la relation après exécution des transactions est le même.

1 Durabilité
2 Cohérence
3 Atomicité
4 Isolation

### 4- Le langage SQL (Structured Query Language)

Nous allons nous servir de la base de données décrite précédemment pour découvrir le langage SQL.

#### 4-1 Création d'une base de données

Nous allons créer 3 bases de données identiques de 3 manières puis nous poursuivrons au travers ce notebook. Nous reviendrons en projet sur la création et la manipulation d'une base de données avec python.

**4-1-1- Création en lignes de commande** :

    - Ouvrir un terminal et placez vous dans votre home ;
    - Création de la base de données que nous appelerons "MyDB1" : sqlite3 MyDB1.db
    - Vous êtes dans l'environnement sqlite, le prompt a changé ">"
    - Pour vérifier la création : .database
    - Pour obtenir de l'aide : .help
    - Pour sortir : .exit (CTRL + D)
    
Un fichier MyDB1.db doit être présent dans votre répertoire.

**4-1-2- Création à partir d'un script python** :

In [ ]:
import sqlite3
connexion = sqlite3.connect('MyDB2.db') # connection ,création si non existe
curseur=connexion.cursor() # création d'un objet pour réaliser des requêtes

Un fichier MyDB2.db doit être présent dans votre répertoire.

Vous pouvez maintenant supprimer ces deux bases.

**4-1-3- Création à partir du notebook** :

Grâce à l'extension **ipython-sql** qu'il faut activer en validant la cellule suivante, nous allons pouvoir faire des requêtes SQL.

In [2]:
%load_ext sql

In [8]:
%reload_ext sql

In [9]:
%sql sqlite:///terminale.db -- Création de la base de données "terminale.db"

0 rows affected.

[]

#### 4-2 Création d'une table

<div class="alert alert-success">
    
Cette première table est un peu plus complexe à créer car elle possède une clé étrangère. La dernière ligne permet de déclarer une contrainte sur cette clé afin d'indiquer à SQLite que "code_postal" est une clé étrangère. SQLite sera alors responsable de maintenir la cohérence entre les deux tables "ELEVE" et "VILLE".
<div>

In [10]:
%%sql sqlite://
    
CREATE TABLE ELEVE
(
Id_eleve INTEGER PRIMARY KEY,
nom TEXT NOT NULL,
prenom TEXT,
statut TEXT,
code_postal INTEGER NOT NULL,
FOREIGN KEY (code_postal) REFERENCES VILLE(code_postal)    
);

Done.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>
    
Par analogie avec la création précédente, créer la table ville.
<div>

In [11]:
%%sql sqlite://
    
CREATE TABLE VILLE
(
code_postal INTEGER PRIMARY KEY,
libelle_ville TEXT
);

Done.

[]

#### 4-3 Suppression d'une table

Si vous avez constaté une erreur après la création de la table et avant d'insérer des enregistrements, vous pouvez supprime une table avec la commande :

In [28]:
%%sql sqlite://
    
DROP TABLE ELEVE;

(sqlite3.OperationalError) no such table: ELEVE
[SQL: DROP TABLE ELEVE;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

#### 4-4 Insertion des données

In [12]:
%%sql sqlite://

INSERT INTO VILLE VALUES(29490,'Guipavas');
INSERT INTO VILLE VALUES(29820,'Guilers');
INSERT INTO VILLE VALUES(29200,'Brest');
INSERT INTO VILLE VALUES(29160,'Crozon');
INSERT INTO VILLE VALUES(29590,'Le Faou ');
INSERT INTO VILLE VALUES(29830,'Ploudalmézeau');
INSERT INTO VILLE VALUES(29290,'Saint Renan');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql sqlite://

INSERT INTO ELEVE VALUES(1,'Bourgon','Élise','demi-pens',29490);
INSERT INTO ELEVE VALUES(2,'Jacq','Christine','demi-pens',29820);
INSERT INTO ELEVE VALUES(3,'Durand','Mathis','externe',29200);
INSERT INTO ELEVE VALUES(4,'Gontran','Élouan','demi-pens',29290);
INSERT INTO ELEVE VALUES(5,'Fox','Titouan','demi-pens',29490 );
INSERT INTO ELEVE VALUES(6,'Majo','Aya','externe',29200 );
INSERT INTO ELEVE VALUES(7,'Tripaux','Jean','interne',29160 );
INSERT INTO ELEVE VALUES(8,'Chavin','Hassan','interne',29590 );
INSERT INTO ELEVE VALUES(9,'Marvaux','Éloi','externe',29200 );
INSERT INTO ELEVE VALUES(10,'Savino','Manel','interne',29830 );

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

Avant d'aller plus loin, verifier vos saisies avec l'éditeur en ligne par exemple : https://extendsclass.com/sqlite-browser.html
<div>

#### 4-5 Interroger la base de données

<div class="alert alert-success">
    
Plutôt que d'utiliser l'outil en ligne, on aurait pu interroger la base de données. C'est ce que nous allons faire maintenant.
<div>

In [31]:
%%sql sqlite://

SELECT * FROM ELEVE;

Done.

[(1, 'Bourgon', 'Élise', 'demi-pens', 29490),
 (2, 'Jacq', 'Christine', 'demi-pens', 29820),
 (3, 'Durand', 'Mathis', 'externe', 29200),
 (4, 'Gontran', 'Élouan', 'demi-pens', 29290),
 (5, 'Fox', 'Titouan', 'demi-pens', 29490),
 (6, 'Majo', 'Aya', 'externe', 29200),
 (7, 'Tripaux', 'Jean', 'interne', 29160),
 (8, 'Chavin', 'Hassan', 'interne', 29590),
 (9, 'Marvaux', 'Éloi', 'externe', 29200),
 (10, 'Savino', 'Manel', 'interne', 29830)]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler votre requête pour afficher l'intégralité de la table VILLE.
<div>

In [32]:
%%sql sqlite://

SELECT * FROM VILLE;

Done.

[(29160, 'Crozon'),
 (29200, 'Brest'),
 (29290, 'Saint Renan'),
 (29490, 'Guipavas'),
 (29590, 'Le Faou '),
 (29820, 'Guilers'),
 (29830, 'Ploudalmézeau')]

<div class="alert alert-success">
    
Afinons un peu les recherches en utilisant des clauses du langage SQL : WHERE, LIKE, COUNT, ORDER BY, DISTINCT, DESC et JOIN
    
- Voici une requête qui doit me donner le nom, prénom et le statut de tous les élèves qui habitent à Brest, autrement dit, qui ont le code postal 29200.
    
<div>

In [33]:
%%sql sqlite://

SELECT nom, prenom, statut FROM ELEVE WHERE code_postal= 29200;

Done.

[('Durand', 'Mathis', 'externe'),
 ('Majo', 'Aya', 'externe'),
 ('Marvaux', 'Éloi', 'externe')]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler des requêtes qui donnent les résultats suivants :
    - La liste des élèves (nom et prénom) internes ;
    - La ville dont le code postal est 29830
<div>

In [35]:
%%sql sqlite://
    
SELECT * FROM ELEVE WHERE statut="interne"

Done.

[(7, 'Tripaux', 'Jean', 'interne', 29160),
 (8, 'Chavin', 'Hassan', 'interne', 29590),
 (10, 'Savino', 'Manel', 'interne', 29830)]

In [37]:
%%sql sqlite://

SELECT * FROM VILLE WHERE code_postal=29830

Done.

[(29830, 'Ploudalmézeau')]

<div class="alert alert-success">
    
Afinons un peu les recherches en utilisant des clauses du langage SQL : WHERE, LIKE, COUNT, ORDER BY, DISTINCT,  DESC et JOIN
    
- Voici une requête qui doit me donner le nom, prénom et le statut de tous les élèves qui habitent à Brest, autrement dit, qui ont le code postal 29200.
<div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Que fait cette requête ? Détailler le rôle de chaque clause.
<div>

In [38]:
%%sql sqlite://
    
SELECT nom, prenom FROM ELEVE WHERE nom LIKE 'C%' OR prenom LIKE 'M%';

Done.

[('Durand', 'Mathis'), ('Chavin', 'Hassan'), ('Savino', 'Manel')]

nom LIKE 'C%' --> Le nom commence par C

OU

prenom LIKE 'M%'; --> Le prénom commence par M

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Par analogie avec la précédente, formuler une requête qui donne la liste des élèves (nom et prénom) dont le nom commence par D et qui sont externes.
<div>

In [49]:
%%sql sqlite://
SELECT nom, prenom FROM ELEVE WHERE nom LIKE "D%" AND statut="externe"

Done.

[('Durand', 'Mathis')]

<div class="alert alert-success">
     
- Voici une requête qui doit me donner le nombre d'élèves qui habitent à Brest.
    
Remarque : D'autres fonctions de groupe existent : AVG, SUM, MIN, MAX (à vous de tester et d'identifer la fonction)
<div>

In [50]:
%%sql sqlite://
    
SELECT COUNT(*) FROM ELEVE WHERE code_postal=29200;

Done.

[(3,)]

<div class="alert alert-success">
     
- Voici une requête qui me donne le nom et prénom des élèves par ordre croissant (lexicographique). Pour l'avoir dans l'ordre décroissant, il faut rajouter DESC à la fin de la requête.
<div>

In [53]:
%%sql sqlite://
    
SELECT nom, prenom FROM ELEVE ORDER BY nom;

Done.

[('Bourgon', 'Élise'),
 ('Chavin', 'Hassan'),
 ('Durand', 'Mathis'),
 ('Fox', 'Titouan'),
 ('Gontran', 'Élouan'),
 ('Jacq', 'Christine'),
 ('Majo', 'Aya'),
 ('Marvaux', 'Éloi'),
 ('Savino', 'Manel'),
 ('Tripaux', 'Jean')]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête qui me donne la liste des codes postaux de la table ELEVE dans l'ordre croissant.

J'aurais pu les obtenir et sans doublons à partir de la table VILLE. Cela va nous permettre d'introduire une nouvelle clause : DISTINCT.
    
- Placer la clause DISTINCT après le SELECT et constater la différence.
<div>

In [57]:
%%sql sqlite://

SELECT code_postal FROM ELEVE ORDER BY code_postal

Done.

[(29160,),
 (29200,),
 (29200,),
 (29200,),
 (29290,),
 (29490,),
 (29490,),
 (29590,),
 (29820,),
 (29830,)]

In [58]:
%%sql sqlite://

SELECT code_postal FROM ELEVE ORDER BY code_postal

Done.

[(29160,),
 (29200,),
 (29200,),
 (29200,),
 (29290,),
 (29490,),
 (29490,),
 (29590,),
 (29820,),
 (29830,)]

<div class="alert alert-success">
     
Nous allons maintenant aborder des requêtes qui vont porter sur les 2 tables pour réaliser des jointures.
    
- Voici une premiere requête qui me donne le nom et prénom des élèves et la ville de résidence écrite de manière "classique", puis une seconde exploitant le fait que l'attribut "code_postal" est identique dans les 2 tables.
    
Remarque : Lorsqu'il y a ambiguïté sur le nom de l'attribut, on le fait précéder du nom de la table. attribut.
<div>

In [60]:
%%sql sqlite://
    
SELECT nom, prenom, libelle_ville FROM ELEVE JOIN VILLE ON ELEVE.code_postal = VILLE.code_postal;

Done.

[('Bourgon', 'Élise', 'Guipavas'),
 ('Jacq', 'Christine', 'Guilers'),
 ('Durand', 'Mathis', 'Brest'),
 ('Gontran', 'Élouan', 'Saint Renan'),
 ('Fox', 'Titouan', 'Guipavas'),
 ('Majo', 'Aya', 'Brest'),
 ('Tripaux', 'Jean', 'Crozon'),
 ('Chavin', 'Hassan', 'Le Faou '),
 ('Marvaux', 'Éloi', 'Brest'),
 ('Savino', 'Manel', 'Ploudalmézeau')]

#### 4-6 Insertion et mise à jour de la base de données

<div class="alert alert-success">
<img src="Images/warning.png" alt="Attention" width=5% align=left>
     
Il faudra manipuler les requêtes qui vont suivre avec précaution car elles peuvent effacer des données, mais aussi altérer la cohérence des données.
    
**Conseil** : tester votre requête avec la clause SELECT. Si vous obtenez les données que vous voulez supprimer ou modifier, modifier la clause par DELETE ou DELETE.
<div>

<div class="alert alert-success">
     
- Voici une requête insere dans la table VILLE, le code postal et le libellé de la ville LE CONQUET : 29232.
<div>

In [14]:
%%sql sqlite://
    
INSERT INTO VILLE (code_postal, libelle_ville) VALUES (29232,'Le Conquet');

1 rows affected.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour vérifier l'insertion.
<div>

In [65]:
%%sql sqlite://

SELECT libelle_ville FROM VILLE WHERE code_postal=29232

Done.

[('Le Conquet',)]

<div class="alert alert-success">

Hélas, je me suis trompé de code postal. Il s'agissait du 29217 !

- Voici une requête qui devrait rectifier l'erreur.
<div>

In [15]:
%%sql sqlite://
    
UPDATE VILLE SET code_postal=29217 WHERE libelle_ville='Le Conquet';

1 rows affected.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour vérifier la modification.
<div>

In [67]:
%%sql sqlite://

SELECT libelle_ville FROM VILLE WHERE code_postal=29217

Done.

[('Le Conquet',)]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

    
Fox titouan a déménagé sur Le Conquet. Il choisit de venir à l'internat de l'école.
    
- Formuler une requête unique pour procéder aux modifications.
<div>

In [16]:
%%sql sqlite://

UPDATE ELEVE SET code_postal=29217, statut='interne' WHERE nom='Fox' AND prenom ='Titouan'

1 rows affected.

[]

<div class="alert alert-success">

Je m'aperçois un peu tardivement que pour la gestion de l'internat, il aurait été souhaitable d'avoir le sexe de la personne.

- Voici une requête va permettre de rajouter un attribut "sexe" à la table ELEVES.
<div>

In [17]:
%%sql sqlite://
    
ALTER TABLE ELEVE ADD COLUMN sexe TEXT;

Done.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour constater la modification et le type de donnée.
<div>

In [77]:
%%sql sqlite://

SELECT * FROM ELEVE

Done.

[(1, 'Bourgon', 'Élise', 'demi-pens', 29490, None),
 (2, 'Jacq', 'Christine', 'demi-pens', 29820, None),
 (3, 'Durand', 'Mathis', 'externe', 29200, None),
 (4, 'Gontran', 'Élouan', 'demi-pens', 29290, None),
 (5, 'Fox', 'Titouan', 'interne', 29217, None),
 (6, 'Majo', 'Aya', 'externe', 29200, None),
 (7, 'Tripaux', 'Jean', 'interne', 29160, None),
 (8, 'Chavin', 'Hassan', 'interne', 29590, None),
 (9, 'Marvaux', 'Éloi', 'externe', 29200, None),
 (10, 'Savino', 'Manel', 'interne', 29830, None)]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

    
Majo aya a déménagé et n'est plus au lycée. Il faut supprimer son enregistrement.
    
- Voici la requête qui convient.
<div>

In [18]:
%%sql sqlite://
    
DELETE FROM ELEVE WHERE nom='Majo' AND prenom='Aya' AND Id_eleve=6

1 rows affected.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour constater la modification et le type de donnée.
<div>

In [82]:
%%sql sqlite://

SELECT * FROM ELEVE WHERE nom='Majo' AND prenom='Aya'

Done.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

Un nouvel élève arrive au lycée. Il s'agit de Monsieur Kappra Marcel qui habite à Saint Renan et qui sera externe.

- Formuler une requête pour insérer cet enregistrement ;
- Profiter pour faire une mise à jour des enregistrements en indiquant le sexe des autres élèves.
<div>

In [21]:
%%sql sqlite://
    
INSERT INTO ELEVE (Id_eleve, nom, prenom, statut, code_postal, sexe) VALUES (6, 'KAPPRA', 'Marcel', 'externe', 29280, 'M');

1 rows affected.

[]

In [20]:
%%sql sqlite://
    
DELETE FROM ELEVE WHERE nom='KAPPRA'

1 rows affected.

[]

In [22]:
%%sql sqlite://
    
UPDATE ELEVE SET sexe='M' WHERE Id_eleve=3 OR Id_eleve=4 OR Id_eleve=5 OR Id_eleve=6 OR Id_eleve=7 OR Id_eleve=8 OR Id_eleve=9 OR Id_eleve=10

8 rows affected.

[]

In [24]:
%%sql sqlite://
    
UPDATE ELEVE SET sexe='F' WHERE Id_eleve=1 OR Id_eleve=2

2 rows affected.

[]

In [25]:
%%sql sqlite://

SELECT * FROM ELEVE

Done.

[(1, 'Bourgon', 'Élise', 'demi-pens', 29490, 'F'),
 (2, 'Jacq', 'Christine', 'demi-pens', 29820, 'F'),
 (3, 'Durand', 'Mathis', 'externe', 29200, 'M'),
 (4, 'Gontran', 'Élouan', 'demi-pens', 29290, 'M'),
 (5, 'Fox', 'Titouan', 'interne', 29217, 'M'),
 (6, 'KAPPRA', 'Marcel', 'externe', 29280, 'M'),
 (7, 'Tripaux', 'Jean', 'interne', 29160, 'M'),
 (8, 'Chavin', 'Hassan', 'interne', 29590, 'M'),
 (9, 'Marvaux', 'Éloi', 'externe', 29200, 'M'),
 (10, 'Savino', 'Manel', 'interne', 29830, 'M')]

<div class="alert alert-success">

    
Pour apprendre à supprimer une table, nous allons en créer une à l'aide d'une requête. Nous allons créer une table "Liste" qui contiendra le nom, le prénom et la ville.
    
- Voici la requête .
<div>

In [26]:
%%sql sqlite://

CREATE TABLE Liste AS SELECT nom, prenom, libelle_ville FROM ELEVE JOIN VILLE USING (code_postal);

Done.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour constater la création.
<div>

In [27]:
%%sql sqlite://
    
SELECT * FROM Liste

Done.

[('Bourgon', 'Élise', 'Guipavas'),
 ('Jacq', 'Christine', 'Guilers'),
 ('Durand', 'Mathis', 'Brest'),
 ('Gontran', 'Élouan', 'Saint Renan'),
 ('Fox', 'Titouan', 'Le Conquet'),
 ('Tripaux', 'Jean', 'Crozon'),
 ('Chavin', 'Hassan', 'Le Faou '),
 ('Marvaux', 'Éloi', 'Brest'),
 ('Savino', 'Manel', 'Ploudalmézeau')]

<div class="alert alert-success">

Voici la requête pour supprimer une table.
<div>

In [ ]:
%%sql sqlite://
    
DROP TABLE Liste;